GIFTS_INFO = {
    '决赛圈': {
        '欧皇大礼包': [['金币', 20000000, '冰雪天']],
        '非酋之证': [['听风代代传承的金币', 1, '非酋泥头车']]
    },
    '坐骑区': {
        '飞天小魔女套装': [['小飞机', 1, '欸嘿嘿'], ['白化黑山羊', 1, '五导']],
        '飞天小魔男套装': [['小飞机', 1, 'moyer'], ['白化黑山羊', 1, '五导']],
        '双飞双宿套装（左半）': [['飞床', 1, '终焉之风'], ['白化黑山羊', 1, '五导']],
        '双飞双宿套装（右半）': [['飞床', 1, '终焉之风'], ['白化黑山羊', 1, '五导']],
        '臀肉烧烤套装': [['火巨人角笛', 1, '七夜'], ['白化黑山羊', 1, '五导']],
        '与蟹共舞套装1': [['飞床', 1, '纱纱翡'], ['大壳蟹角笛', 1, '山葵树']],
        '与蟹共舞套装2': [['飞床', 1, '山下的山葵树'], ['大壳蟹角笛', 1, '山葵树']],
        '偶勒哇刚大木': [['红甲小宝/可换彩虹小马', 1, '沈夜白邱集'], ['白化黑山羊', 1, '五导']],
        '劳动最光荣': [['劳动14号密匙', 1, '终焉之风'], ['白化黑山羊', 1, '五导']],
        '死宫踏破者': [['黑天马', 1, '潜规则'], ['白化黑山羊', 1, '五导']],
        '大被同眠套装（左半）': [['飞床', 1, '噗哈哈'], ['白化黑山羊', 1, '五导']],
        '大被同眠套装（右半）': [['飞床', 1, '八寻'], ['白化黑山羊', 1, '五导']]
    },
    '幻化区': {
        '巴啦啦能量jk全身变套装': [['洗澡水', 1, '噗哈哈'], ['基拉巴尼亚编发', 1, '姜淮'], ['jk套装', 1, '果果']],
        '我家房子很大，玩累了可以直接睡套装.jpg': [['弦月套', 1, 'uuz']],
        '黄毛老大': [['洗澡水', 3, '源千代'], ['休闲外套箱', 1, '南雲鐵虎']],
        '黄毛跟班1号': [['休闲外套箱', 1, 'loopin']],
        '黄毛跟班2号': [['休闲外套箱', 1, '纱纱翡']],
        '时 尚 先 锋套装': [['休闲装备箱', 1, '墨扉倾雪'], ['圣龙装备箱', 1, '墨扉倾雪'], ['库啵装备箱', 1, '墨扉倾雪'], ['鬼神武器', 1, '墨扉倾雪']],
        '乖，戴好别歪了.jpg': [['弦月帽', 1, '果果'], ['金属绿染剂', 1, '兔坦'], ['库啵装备箱', 1, '黑丸'], ['圣龙装备箱', 1, '黑丸']]
    },
    '拂晓精炼区': {
        '为所欲为ultra': [['228自选', 1, '兔坦']],
        '为所欲为plus': [['200自选', 1, '思念']],
        '为所欲为青春版1': [['168自选', 1, '松塔']],
        '为所欲为青春版2': [['168自选', 1, '李依李']],
        '为所欲为荣耀版1': [['128自选', 1, '忍怜多']],
        '为所欲为荣耀版2': [['128自选', 1, '式部']],
        '为所欲为荣耀版3': [['128自选', 1, '绘缨']],
        '为所欲为荣耀版4': [['128自选', 1, 'pamper']],
        '为所欲为荣耀版5': [['128自选', 1, '夫人']],
        '为所欲为迷你杯1': [['50自选', 1, '理央的猫']],
        '为所欲为迷你杯2': [['50自选', 1, '早川理央']],
        '为所欲为迷你杯3': [['50自选', 1, '木天藜']],
        '为所欲为迷你杯4': [['50自选', 1, '赤星泰我']],
        '为所欲为迷你杯5': [['50自选', 1, '子言']],
        '为所欲为迷你杯6': [['50自选', 1, '万丈空我']],
        '为所欲为迷你杯7': [['50自选', 1, '眉倦千秋月']],
        '为所欲为迷你杯8': [['50自选', 1, '火村郢生']],
        '为所欲为迷你杯9': [['50自选', 1, '琴弦的咏叹调']],
        '为所欲为迷你杯10': [['50自选', 1, '华采衣兮若英']],
        '为所欲为迷你杯11': [['50自选', 1, '噫面']]
    },
    '金币区': {
        '山东菏泽曹县666窝哩宝贝': [['金币', 6660000, '真壁一骑']],
        '双色球一等奖单注一号': [['金币', 5000000, '加藤段藏']],
        '双色球一等奖单注二号': [['金币', 5000000, '非酋']],
        '哔哩哔哩干杯[]~(￣▽￣)~*': [['金币', 2330000, '钟灵毓秀']],
        '艾欧泽亚硬通货': [['白金币', 300, '冰雪天']],
        '神1之地五月税收': [['金币', 3333333, '塔尔']],
        '财神爷祝福': [['金币', 888888, '八寻'], ['金币', 2000000, '黑丸']]
    },
    '宠物区': {
        '如鱼得水套餐1': [['水小滴', 1, '华彩衣兮若英'], ['椒盐海豹', 1, '藤本早苗'], ['大壳蟹角笛', 1, '山葵树']],
        '如鱼得水套餐2': [['水小滴', 1, '早坂爱'], ['椒盐海豹', 1, '藤本早苗'], ['大壳蟹角笛', 1, '山葵树']],
        '动物园套餐': [['食果花鼠', 1, '糖球'], ['白小虎', 1, '糖球'], ['水小滴', 1, '暗影逝'], ['豆豆柴', 1, '暗影逝'], ['大壳蟹角笛', 1, '山葵树']]
    },
    '大工匠专属五星级vip黑金特区': {
        '带薪休假套餐': [['雾娟', 2, '糖球'], ['雾娟', 1, '早坂爱'], ['巨匠药水', 999, '南雲鐵虎'], ['白虎布', 1, '王嘉兴'],
                   ['月读布', 1, '王嘉兴'], ['4级爆发药/510料理', 99, '松塔']]
    }
}


GUYS = [
    '纱纱翡',
    '排排坐次果果',
    '忍怜多',
    'Pamper',
    '式部茉优',
    '黑丸',
    '潜规则',
    '钟灵毓秀',
    '噗哈哈哈哈',
    '万丈空我',
    '暗影逝',
    '五仁汤圆',
    '眉倦千秋月',
    '七夜丶心',
    '沈夜白邱集',
    '墨扉倾雪',
    '南雲鐵虎',
    '欸嘿嘿嘿嘿',
    '王嘉兴',
    '盐酸托莫西汀',
    '火村郢生',
    '八寻和迩',
    '万卷蓟夫人',
    '加藤段藏',
    '绘缨',
    '木天藜',
    '早坂爱',
    '伊什塔尔',
    '姜淮',
    '理央的猫',
    '真壁一骑',
    '纯爱战士uuz',
    '终焉之风',
    '琉璃色的回忆',
    '雾雨売花',
    '李依李',
    '一糖球一',
    '气泡兔坦',
    '早川理央',
    'Loopin',
    '赤星泰我',
    '噫面',
    '源千代',
    '樱落冰雪天',
    '咸鱼子言',
    '华采衣兮若英',
    '望月理奈',
    '琴弦的咏叹调',
    '非酋妙尔尼尔',
    '藤本早苗',
    'Moyer',
    '山下的山葵树'
]

WELCOME_SENTENCES = [
    ['“这里本该有一段感动人心的开场白，', '总结一下这一年来听风部队在艾欧泽亚的冒险故事，', '但工期不够，下次一定！”',
     '\t\t\t\t————酱瓜'],
    ['大家晚上好！', '本次的抽奖活动就由我————茄子Robot和鱼导共同主持', '请大家陆续就坐，准备好瓜子爆米花', '活动马上开始惹！'],
    ['茄子：首先先请现任部队长，萌一霸噗哈哈哈哈发表致辞！', '不知名的听风成员：/image 哈姐', '【吐槽】你在想桃吃：爱你们',
     '【吐槽】你在想桃吃：新的一年也会继续网暴大家的', '？？？：嘻嘻', '（鼓掌声）'],
    ['茄子：好的，真的是非常精彩发言捏', '茄子：下面由我来介绍一下这次活动：', '这次活动叫圣币战争', '听风有一枚传说中的硬币',
     '这枚硬币有着打破这个世界协调之理的力量', '必须要由一位光之战士戴着才能压制它', '但人类的力量是有极限的，每隔半年，圣币就会突破压制，引发巨大的灾难',
     '而听风部队也会出动大批勇士，首先去艾欧泽亚各处封印以太乱流', '最后由真正的强运之人来封印圣币', '而我们的26位光之战士，已经集结了起来...'],
    ['正在加载基础数据...', '在部队房摆上新鲜的食物...', '移除礼物堆中的白化黑山羊角笛', '正在播放Never Gonna Give You Up...',
     '盖亚正在跳真夜舞蹈', '脑补幕布徐徐打开的样子...']
]

PROCESS_SENTENCES = [
    ['正在准备感恩节火鸡...', '把洗好的火鸡放在烤盘上...', '摆上好看的果蔬...', '放入拉拉肥填料...', '烤生进入考场...'],
    ['早苗正在搓部队食物...', '早苗把食物放满了部队房屋...', '半夜1点，鱼导上线......'],
    ['“渣女吃了么？', '没吃的话', '吃我一刀.jpg”'],
    ['冒险者你好', '敏菲利亚叫你来一趟沙之家'],
    ['生命之色涡旋流转————', '七重之门现于世间————', '力量之塔君临九天————', '究↑极↓'],
    ['喂天使，run']
]

SHOW_TIME = [
    ['尼尔3墨菲赤魔大招'],
    ['鱼导绝亚营救'],
    ['12s st没开盾'],
    ['冰岛死人+救人'],
    ['强开S怪'],
    ['豆芽，冰柱，导师*3'],
    ['在路上，被摩托撞掉线'],
]